trade_exp/src/DataProcessors/ПроверкаАдресногоХранения/ПроверкаАдресногоХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПроверкаАдресногоХранения</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходнаяЯчейка</name>
      <type>
        <types>CatalogRef.СкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦелеваяЯчейка</name>
      <type>
        <types>CatalogRef.СкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Проверено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.ДействияПриПроверкеАдресногоХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>НетЭтикетки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Наш</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="a9733f12-e26b-44d6-8c73-49b629ab1280">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ЭлектроннаяОчередьКлиентов/ЭлектроннаяОчередьКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d8c9c294-870a-44ea-8c5a-f42a13a7459f">
  <name>ЭлектроннаяОчередьКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="7bf41d18-a27a-4fba-80a3-8f6785279797">
    <name>ЧастичноОтгружен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b0a91b44-0e01-4076-bc0a-e247692c423d">
    <name>Заехал</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e7944fb5-14d5-41da-8470-3a465f450b0b">
    <name>ОтметкаКассы</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="99ad658e-788e-4122-b16a-fcaa62283677">
    <name>ТребуетсяОповещениеКладовщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="0e22a688-0adf-48bf-b768-8d362798bfa0">
    <name>ПолучательУведомления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="801d9ec6-cb3c-4867-98c2-4afaa72c9673">
    <name>СтатусОрдера</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5dccbe81-f872-46d5-a8a5-30af95c1f5d6">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d26f016a-39dd-4378-824e-bb04999f6b10">
    <name>ССайта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5888bede-9c96-4076-b99f-977e4a559fc0">
    <name>НомерДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="f75ffc24-34ae-4ec8-92d2-90c5ccaaa229">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="16ef9874-783e-49a8-bbc6-59fbe7b17586">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f3371cf8-1d4f-43fc-a7ad-e3e827a6f002">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/ДействияПриПроверкеАдресногоХранения/ДействияПриПроверкеАдресногоХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="cc11fa7c-d2a9-4c13-9d56-a6f77444d68b">
  <name>ДействияПриПроверкеАдресногоХранения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="6e205829-0d0c-48c7-9bed-49712f48d941">
    <name>ПереложитьВДругуюЯчейку</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="75107e97-c012-4e72-8310-683457edd446">
    <name>ПрисвоитьТекущуюЯчейку</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="af13aadd-1ff3-4ca9-ad06-5b916348a725">
    <name>СделатьЯчейкуДополнительной</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыЭлектроннойОчереди/СтатусыЭлектроннойОчереди.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="50ebb253-dfc9-40d8-b492-fcbfb669bc01">
  <name>СтатусыЭлектроннойОчереди</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b235c12d-541e-4263-bf1d-e5521ad06455">
    <name>ОжидаетсяОтбор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="83736d22-9656-4e5f-97c8-dcdcdec7ef61">
    <name>Набирается</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c45f0107-54a2-4b21-ae97-e14dca629ad9">
    <name>Набран</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a5091316-357f-4d00-9ffb-5683c9bac672">
    <name>Выдан</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/СкладскиеЯчейки/СкладскиеЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СкладскиеЯчейки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Склады</owners>
  <attributes>
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="066e30f6-7b05-4707-b88c-048e47e0ee62">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>39</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f3e5dfce-ce94-489f-bbc6-ba1b699e6a56">
    <name>ИспользованиеПериодичностиИнвентаризацииЯчейки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b7afe322-1954-42ee-b9f7-20803df9f4db">
    <name>КоличествоДнейМеждуИнвентаризациями</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="942b70ab-8729-495e-aa2e-e362fab7ecfd">
    <name>ТипСкладскойЯчейки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c08d78e7-8199-4896-a9fc-9ac0cb946bff">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="60091b4d-b59a-402b-8b0a-8f53fca6515a">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c4e170cc-c732-4607-8975-9c5a1ff87d55">
    <name>Линия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a5ca5828-4e29-461b-885b-7139ab2b8f0d">
    <name>Стеллаж</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="56a97705-349f-4913-8e45-02a642ba3195">
    <name>ПорядокОбхода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea064545-91fd-46da-987c-a068e1b5f13f">
    <name>Ярус</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc923ed7-93a9-4ab2-80bf-95d378dac70c">
    <name>Позиция</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="82b6a5ac-4bdb-4046-b405-1382915a4c74">
    <name>УровеньДоступности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b4a34412-3576-4048-b17b-40befc421c3f">
    <name>Типоразмер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="61217d52-e955-4b33-bc99-11d43aa1c1d9">
    <name>ОбластьХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63793c84-fe0a-46a7-b089-23086db66ef4">
    <name>МаксимальныйКоэффициентНаполненностиПоОбъему</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="45830319-bd9f-49d6-afc3-425511de0559">
    <name>МаксимальныйКоэффициентНаполненностиПоВесу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Catalogs/РабочиеУчастки/РабочиеУчастки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7c863b06-6e02-4c69-add5-1e7cdc4b412d">
  <name>РабочиеУчастки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Склады</owners>
  <attributes>
    <name>Порядок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОграничиватьПоВесу</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОграничениеПоВесу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПорядокОбработкиСкладскогоЗадания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОграничениеПоОбъему</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОграничиватьПоОбъему</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользуетсяВПреднаборке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВыдачаВОкно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользуетсяВПриемкеСТСД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользуетсяВОтгрузкеСТСД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаСкладскихЯчеекХраненияПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d60f4b7b-33b6-404d-a00a-86bdd9eddd85">
    <name>ИнтервалОповещений</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0d146d97-4688-44d2-86c1-47fc265eda01">
    <name>СкрытьКоличествоПоУчету</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="24236bcd-ee24-4288-b790-a71e6ec62dae">
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="45e29f47-2a23-4196-a70d-24909d3aaaae">
    <name>ЭлектроннаяОчередь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/DataProcessors/ПроверкаАдресногоХранения/Forms/ФормаТСД/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	Если Параметры.Свойство("Сотрудник") Тогда
       Объект.Сотрудник = Параметры.Сотрудник;
	   Объект.Склад = Объект.Сотрудник.Склад;
	КонецЕсли;
	
	ЭтаФорма.Заголовок = "Выбор режима";
	ЭтаФорма.Элементы.ГруппаРабота.Видимость = Ложь;
	ЭтаФорма.Элементы.ГруппаРедактированиеСтроки.Видимость = Ложь;
	ЭтаФорма.Элементы.ГруппаВыборНоменклатуры.Видимость = Ложь;
	
	ДействиеПрисвоитьТекущуюЯчейку = Перечисления.ДействияПриПроверкеАдресногоХранения.ПрисвоитьТекущуюЯчейку;	
	ДействиеПереложитьВДругуюЯчейку = Перечисления.ДействияПриПроверкеАдресногоХранения.ПереложитьВДругуюЯчейку;
	ДействиеСделатьЯчейкуДополнительной = Перечисления.ДействияПриПроверкеАдресногоХранения.СделатьЯчейкуДополнительной;
	СкладскиеЯчейкиПустаяСсылка = Справочники.СкладскиеЯчейки.ПустаяСсылка();
	НоменклатураПустаяСсылка = Справочники.Номенклатура.ПустаяСсылка();   
	
	//Подключение оповещений из очереди 
	СекцииСотрудника = Объект.Сотрудник.РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток");
	СообщениеОбработано = Истина;
	Если ЭлектроннаяОчередьНаСекции() Тогда //Если у секции нет флага ЭлектроннаяОчередь, то ее подключение на ТСД не нужно 
		Если Не ПолучитьСостояниеОповещений() Тогда
			ОповещенияИзОчереди = Истина;
		Иначе
			ОповещенияИзОчереди = Объект.Сотрудник.ОповещенияИзОчереди; 
		КонецЕсли;
	Иначе 
		ОповещенияИзОчереди = Ложь; 	
	КонецЕсли; 
	Инт = 60;
	Для каждого Стр Из СекцииСотрудника Цикл
		ЗнчИнтервала = Стр.Значение.ИнтервалОповещений;
		Если ЗнчИнтервала <> 0 И Инт > ЗнчИнтервала Тогда
			Инт = ЗнчИнтервала;
		КонецЕсли; 
	КонецЦикла; 
	ИнтервалОповещений = Инт;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
    ИнициализироватьСканер();
	
	Если ОповещенияИзОчереди Тогда 
		Элементы.ГруппаСписокОчереди.Видимость = Истина; 
		ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь);
		ПроверкаЭлектроннойОчереди(); 
	Иначе 
		Элементы.ГруппаСписокОчереди.Видимость = Ложь;	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ЗавершениеРаботы Тогда
		
		Если Не ПодтвержденоЗакрытиеФормы Тогда 
			Отказ = Истина;
	    	ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), "Завершить работу по проверке адресного хранения?", РежимДиалогаВопрос.ДаНет, 5 ,КодВозвратаДиалога.Нет);		
		КонецЕсли;
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПодтвержденоЗакрытиеФормы = Истина;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПроверкуАХ(Команда)
	ПодтвержденоЗакрытиеФормы = Истина;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	ОтключитьСканер();
КонецПроцедуры

#КонецОбласти

#Область РаботаСоСканеромИШтрихкодами

&НаКлиенте
Процедура ИнициализироватьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		Попытка
		глВКRSDriver.УстановитьПараметр("Barcode_BEEP",Истина);
		глВКRSDriver.УстановитьПараметр("Barcode_BZZ",Истина);
		глВКRSDriver.Подключить("Barcode");	
		Исключение
		КонецПопытки;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		Попытка
			глВКRSDriver.Отключить("Barcode");	
		Исключение
		КонецПопытки;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если (ИмяСобытия = "ScanData" ИЛИ ИмяСобытия = "Barcode") Тогда 
			
			Если ТипЗнч(Параметр) = Тип("Массив") Тогда
				Штрихкод1 =  Параметр;
			иначе
				Штрихкод1 = Новый Массив;
				Штрихкод1.Добавить(Параметр);
				Штрихкод1.Добавить(Неопределено);
			конецесли;
			Данные= ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Штрихкод1);
			Штрихкод= Данные.Штрихкод;
			
			Если ПустаяСтрока(Штрихкод) Тогда
				ПоказатьПредупреждение(, "Не удалось прочитать штрихкод! Считайте штрихкод еще раз!", 5);
				Возврат;
			КонецЕсли;
			
			ОбработатьШтрихкоды(Штрихкод);			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СчитатьШтрихкодКамера(Команда)
		#Если МобильныйКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			ОповещениеСканирования = Новый ОписаниеОповещения("ОбработкаОтсканированногоШтрихкодаКамера",ЭтотОбъект);
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Scan code",ОповещениеСканирования,,ТипШтрихкода.Все);
		Иначе
			ПоказатьПредупреждение(, "Сканирование не поддерживается!", 5);
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтсканированногоШтрихкодаКамера(Штрихкод,Результат,Сообщение,ДопПараметры) Экспорт
	
	Если Результат и ЗначениеЗаполнено(Штрихкод) Тогда
		
		#Если МобильныйКлиент Тогда
		    СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		
		Если ПустаяСтрока(Штрихкод) Тогда
			ПоказатьПредупреждение(, "Не удалось прочитать штрихкод! Считайте штрихкод еще раз", 5);
			Возврат;
		КонецЕсли;
			
		ОбработатьШтрихкоды(Штрихкод);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(Штрихкод)
	
	Если (Элементы.ГруппаРабота.Видимость = Истина) Или (Элементы.ГруппаРедактированиеСтроки.Видимость = Истина) Тогда
			
		
		// Штрихкод ячейки
		Если СтрДлина(Штрихкод) > 35   Тогда
			
			МассивСсылок = СсылкаНаЯчейкуПоШтрихкоду(Штрихкод);
			
			// Ячейка найдена
			Если МассивСсылок.Количество() > 0 Тогда
				
				НайденнаяЯчейка = МассивСсылок[0]; 
				
				Если ДоступнаЯчейкаСотрудникуНаСервере(Объект.Сотрудник, НайденнаяЯчейка) Тогда
					
					Если (Элементы.ГруппаРабота.Видимость = Истина) Тогда
						
						Если ЗначениеЗаполнено(Объект.Ячейка) И (НайденнаяЯчейка <> Объект.Ячейка) И ЕстьИзмененияДляЗаписи Тогда
							ДополнительныеПараметры = Новый Структура;
							ДополнительныеПараметры.Вставить("Ячейка", НайденнаяЯчейка);
							ДополнительныеПараметры.Вставить("ПолучитьТоварыИзЯчейки", Истина);
							
							Если Режим = "ПроверкаАХ" Тогда
								ТекстВопроса = "Записать результаты проверки списка товаров" + Символы.ПС + "предыдущей ячейки "  + Объект.Ячейка + "?";
							Иначе
								ТекстВопроса = "Записать внесенный список товаров" + Символы.ПС + "предыдущей ячейки "  + Объект.Ячейка + "?";
							КонецЕсли;
							ПоказатьВопрос(Новый ОписаниеОповещения("ПерезаполнитьТоварыПриВыбореЯчейкиЗавершение", ЭтотОбъект, ДополнительныеПараметры), ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Отмена);
						Иначе
							Объект.Ячейка = НайденнаяЯчейка;
							ТекстПредупреждения = "Ячейка " + НайденнаяЯчейка + " найдена";
							ЗаполнитьНоменклатуруНаСервере();
						КонецЕсли
						
					Иначе
						Если (Действие = ДействиеПереложитьВДругуюЯчейку) Или  (Действие = ДействиеСделатьЯчейкуДополнительной) Тогда
							ЦелеваяЯчейка = НайденнаяЯчейка;
						Иначе
							ПоказатьПредупреждение(, "Выбор фактической ячейки доступен для действий" + Символы.ПС + """Переложить в другую ячейку"" или ""Сделать ячейку дополнительной""", 2);	
						КонецЕсли;
					КонецЕсли;
					
				Иначе
					ТекстПредупреждения = "Ячейка " + НайденнаяЯчейка + " недоступна сотруднику " + Объект.Сотрудник;
					ПоказатьПредупреждение(, ТекстПредупреждения, 2);	
				КонецЕсли;
				
			Иначе
				ПоказатьПредупреждение(, "Ячейка не найдена", 2);	
			КонецЕсли;
			
			
		// Штрихкод товара	
		Иначе
		   Если (Элементы.ГруппаРабота.Видимость = Истина) Тогда
		
					
				Если ЗначениеЗаполнено(Объект.Ячейка) Тогда
					
					ЕстьОсновнаяЯчейка = Ложь;
					Номенклатура = ПолучитьНоменклатуруПоШтрикодуНаСервере(Штрихкод, Объект.Склад, Объект.Ячейка, ЕстьОсновнаяЯчейка);
					
					Если Номенклатура <> НоменклатураПустаяСсылка Тогда
						
						ПараметрыОтбора = Новый Структура("Номенклатура", Номенклатура);
						СтрокиТЧ =  Объект.Товары.НайтиСтроки(ПараметрыОтбора);
						
						Если СтрокиТЧ.Количество() <> 0 Тогда
							НайденнаяСтрока = СтрокиТЧ[0];
							
							Если Режим = "ПроверкаАХ" Тогда
								Если Не НайденнаяСтрока.Проверено Тогда
									НайденнаяСтрока.Проверено = Истина;
									//ПоказатьПредупреждение(, "Товар """ + Номенклатура + """ проверен", 2);	
									ЕстьИзмененияДляЗаписи = Истина;
								Иначе
									ПоказатьПредупреждение(, "Товар """ + Номенклатура + """ уже проверен", 2);	
								КонецЕсли;
							Иначе
								ПоказатьПредупреждение(, "Товар """ + Номенклатура + """ уже добавлен", 2);	
							КонецЕсли;
							
						Иначе
							ДополнительныеПараметры = Новый Структура;
							ДополнительныеПараметры.Вставить("Номенклатура", Номенклатура);
							ДополнительныеПараметры.Вставить("ЕстьОсновнаяЯчейка", ЕстьОсновнаяЯчейка);
							
							Если Режим = "ПроверкаАХ" Тогда
								ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьНоменклатуруВЯчейкуЗавершение", ЭтотОбъект, ДополнительныеПараметры), "Добавить товар """  + Номенклатура + """ в ячейку?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
							Иначе
								ДобавитьНоменклатуруВЯчейкуЗавершение(КодВозвратаДиалога.Да, ДополнительныеПараметры);
							КонецЕсли;
						КонецЕсли;
											
					Иначе
						ПоказатьПредупреждение(, "Товар по штрихкоду не найден", 5);	
					КонецЕсли;
					
				Иначе
					ПоказатьПредупреждение(, "Необходимо сначала выбрать ячейку", 2);		
				КонецЕсли
				
			Иначе	
				
				Если ЗначениеЗаполнено(Номенклатура) Тогда  
					ТекстВопроса = "Требуется присвоить штрихкод: " + Штрихкод + " для " + Номенклатура;  	
					ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтветаОПрисвоенииШтрихкода", ЭтотОбъект, Штрихкод), ТекстВопроса, РежимДиалогаВопрос.ДаНет, 5, КодВозвратаДиалога.Нет);
               	Иначе 
					ПоказатьПредупреждение(, "Необходимо выбрать фактическую ячейку, а не товар", 2);
				КонецЕсли; 
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры   

&НаКлиенте
Процедура ПослеОтветаОПрисвоенииШтрихкода(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СоздатьШК(ДополнительныеПараметры);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция СсылкаНаЯчейкуПоШтрихкоду(Штрихкод)
	Менеджеры = Новый Массив();
	Менеджеры.Добавить(ПредопределенноеЗначение("Справочник.СкладскиеЯчейки.ПустаяСсылка"));
	Возврат ШтрихкодированиеПечатныхФормКлиент.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, Менеджеры);
КонецФункции

&НаСервере
Функция ПолучитьНоменклатуруПоШтрикодуНаСервере(Штрихкод, Склад, Ячейка, ЕстьОсновнаяЯчейка)
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	Возврат ДокументОбъект.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод, Склад, Ячейка, ЕстьОсновнаяЯчейка);
КонецФункции

#КонецОбласти

#Область ВыборРежимаИСменаВидимыхЭлементов

&НаКлиенте
Процедура РежимПроверкаАХ(Команда)
	УстановитьРежим("ПроверкаАХ", "Проверка АХ");
	УстановитьВидимостьГруппы("Работа");
	
	Элементы.ГруппаЭтикеткиДействия.Видимость = Истина;
	
	ПоказыватьНепроверенные = Истина;
	ЭтаФорма.Элементы.ПоказыватьНепроверенные.Видимость = Истина;
	ЭтаФорма.Элементы.ПоказыватьНепроверенные.Заголовок = "Непров.";
	ЭтаФорма.Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("Проверено", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура РежимНовыйСклад(Команда)
	УстановитьРежим("НовыйСклад", "Новый склад");
	УстановитьВидимостьГруппы("Работа");
	
	Элементы.ГруппаЭтикеткиДействия.Видимость = Ложь;
	
	ПоказыватьНепроверенные = Ложь;
	ЭтаФорма.Элементы.ПоказыватьНепроверенные.Видимость = Ложь;
	ЭтаФорма.Элементы.ПоказыватьНепроверенные.Заголовок = "Все";
	ЭтаФорма.Элементы.Товары.ОтборСтрок = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежим(РежимРаботы, Заголовок)
	Режим = РежимРаботы;
	
	Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		ЭтаФорма.Заголовок = Заголовок + " (" + Объект.Сотрудник + ")";		
	Иначе
		ЭтаФорма.Заголовок = Заголовок;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьГруппы(РабочееДействие)
	Элементы.ГруппаВыборРежима.Видимость = Ложь;
	Элементы.ГруппаРабота.Видимость = Ложь;
	Элементы.ГруппаРедактированиеСтроки.Видимость = Ложь;
	Элементы.ГруппаВыборНоменклатуры.Видимость = Ложь;
	
	Если РабочееДействие = "ВыборРежима" Тогда
		Элементы.ГруппаВыборРежима.Видимость = Истина
	ИначеЕсли РабочееДействие = "Работа" Тогда
		Элементы.ГруппаРабота.Видимость = Истина;
	ИначеЕсли РабочееДействие = "РедактированиеСтроки" Тогда
		Элементы.ГруппаРедактированиеСтроки.Видимость = Истина;
	ИначеЕсли РабочееДействие = "ВыборНоменклатуры" Тогда
		Элементы.ГруппаВыборНоменклатуры.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяКВыборуРежима(Команда)
	ТекстВопроса = "Вернуться к выбору режима?";  
	Если Объект.Товары.Количество() > 0 Тогда
		ТекстВопроса = ТекстВопроса + Символы.ПС + "Результаты проверки списка товаров не будут записаны";
	КонецЕсли;	
	ПоказатьВопрос(Новый ОписаниеОповещения("ВернутьсяКВыборуРежимаЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет, 5, КодВозвратаДиалога.Нет);
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяКВыборуРежимаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.Ячейка = СкладскиеЯчейкиПустаяСсылка;
		Объект.Товары.Очистить();
		УстановитьВидимостьГруппы("ВыборРежима");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяКТЧ(Команда)
	СтрокаИзменения = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Если ((Действие = ДействиеПереложитьВДругуюЯчейку) Или (Действие = ДействиеСделатьЯчейкуДополнительной)) И (ЦелеваяЯчейка = СкладскиеЯчейкиПустаяСсылка) Тогда
		ПоказатьПредупреждение(, "Не выбрана фактическая ячейка", 5);	
		Возврат;
	КонецЕсли;
	
	
	Если ((Действие = ДействиеПереложитьВДругуюЯчейку) Или (Действие = ДействиеСделатьЯчейкуДополнительной)) И (ЦелеваяЯчейка = ИсходнаяЯчейка) Тогда
		ПоказатьПредупреждение(, "При этом действии фактическая ячейка "  + Символы.ПС + " должна отличаться от исходной ячейки", 5);	
		Возврат;
	КонецЕсли;
	
	
	Если (СтрокаИзменения.Действие = ДействиеПрисвоитьТекущуюЯчейку) И (Действие <> ДействиеПрисвоитьТекущуюЯчейку) Тогда
		Действие = ДействиеПрисвоитьТекущуюЯчейку; 
		ПоказатьПредупреждение(, "Для данного товара доступно только действие" + " ""Присвоить текущую ячейку""", 5);	
		Возврат;
	КонецЕсли;
		
	Если (СтрокаИзменения.Действие <> ДействиеПрисвоитьТекущуюЯчейку) И (Действие = ДействиеПрисвоитьТекущуюЯчейку) Тогда
		Действие = СтрокаИзменения.Действие;
		ПоказатьПредупреждение(, "Для данного товара не доступно действие:" + " ""Присвоить текущую ячейку""" + Символы.ПС + "Он и так находится в текущей ячейке", 5);	
		Возврат;		
	КонецЕсли;
		
	 	
 	СтрокаИзменения.Действие = Действие;
	Если (Действие = ДействиеПереложитьВДругуюЯчейку) ИЛИ  (Действие = ДействиеСделатьЯчейкуДополнительной) Тогда
		СтрокаИзменения.ЦелеваяЯчейка = ЦелеваяЯчейка;
	КонецЕсли;
	СтрокаИзменения.Проверено = Проверено; 
    СтрокаИзменения.НетЭтикетки = НетЭтикетки; 		

	УстановитьВидимостьГруппы("Работа");	
	ЭтаФорма.ОбновитьОтображениеДанных();
	
	ЕстьИзмененияДляЗаписи = Истина;
КонецПроцедуры

#КонецОбласти

#Область ЗаписиРезультатовПроверкиВРегистр

&НаКлиенте
Процедура Записать(Команда)
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Ячейка", Объект.Ячейка);
	ДополнительныеПараметры.Вставить("ПолучитьТоварыИзЯчейки", Ложь);
	ТекстВопроса = "Записать результаты проверки списка" + Символы.ПС + "товаров ячейки "  + Объект.Ячейка + "?";
	ПоказатьВопрос(Новый ОписаниеОповещения("ПерезаполнитьТоварыПриВыбореЯчейкиЗавершение", ЭтотОбъект, ДополнительныеПараметры), ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 5, КодВозвратаДиалога.Отмена);
КонецПроцедуры

&НаСервере
Функция ЗаписатьВРегистрНаСервере(ТекстСообщения)
	ПолеСообщения = "";
		
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	Результат = ДокументОбъект.ЗаписатьРезультатыПроверкиАХ(ТекстСообщения, ПолеСообщения);
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ВыбораРабочейЯчейки

&НаКлиенте
Процедура ВыбратьЯчейку(Элемент)
    ЗначениеОтбора = Новый Структура;
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		ЗначениеОтбора.Вставить("Владелец", Объект.Склад);
	КонецЕсли;
    ЗначениеОтбора.Вставить("ЭтоГруппа", Ложь);
    ЗначениеОтбора.Вставить("ПометкаУдаления", Ложь);
	
	// Рабочие участки только для ТСД
	Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		ЗначениеОтбора.Вставить("РабочийУчасток", Новый ФиксированныйМассив(ЗаполнитьРабочиеУчасткиНаСервере()));
	КонецЕсли;

    ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);	
	
	Форма = ПолучитьФорму("Справочник.СкладскиеЯчейки.ФормаВыбора", ПараметрыВыбора, Элемент);
	Форма.Элементы.Список.Отображение = ОтображениеТаблицы.Список; 
	Форма.Элементы.Наименование.Видимость = Ложь;
	Форма.Элементы.ОбластьХранения.Видимость = Ложь;
	Форма.Элементы.Помещение.Видимость = Ложь;
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЯчейкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьЯчейку(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЯчейкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Ячейка) И (ВыбранноеЗначение <> Объект.Ячейка) и ЕстьИзмененияДляЗаписи Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Ячейка", ВыбранноеЗначение);
		ДополнительныеПараметры.Вставить("ПолучитьТоварыИзЯчейки", Истина);
		ТекстВопроса = "Записать результаты проверки списка товаров" + Символы.ПС + "предыдущей ячейки "  + Объект.Ячейка + "?";
		ПоказатьВопрос(Новый ОписаниеОповещения("ПерезаполнитьТоварыПриВыбореЯчейкиЗавершение", ЭтотОбъект, ДополнительныеПараметры), ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 5, КодВозвратаДиалога.Отмена);
	Иначе
		Объект.Ячейка = ВыбранноеЗначение;
		ЗаполнитьНоменклатуруНаСервере();
	КонецЕсли

КонецПроцедуры

&НаСервере
Функция ДоступнаЯчейкаСотрудникуНаСервере(Сотрудник, Ячейка)
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	Возврат ДокументОбъект.ДоступнаЯчейкаСотруднику(Сотрудник, Ячейка);
КонецФункции

&НаСервере
Функция ЗаполнитьРабочиеУчасткиНаСервере()
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	Возврат ДокументОбъект.ПолучитьСписокРабочихУчастковСотрудника(Объект.Сотрудник);
КонецФункции

&НаКлиенте
Функция ДобавитьНоменклатуруВЯчейкуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = ДополнительныеПараметры.Номенклатура;
		НоваяСтрока.ЦелеваяЯчейка = Объект.Ячейка;
		
		Если ДополнительныеПараметры.ЕстьОсновнаяЯчейка Тогда
			НоваяСтрока.ИсходнаяЯчейка = Объект.Ячейка
		Иначе
			НоваяСтрока.Действие = ДействиеПрисвоитьТекущуюЯчейку;
		КонецЕсли;
			
		НоваяСтрока.Проверено = Истина;
		ЕстьИзмененияДляЗаписи = Истина;		
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПерезаполнитьТоварыПриВыбореЯчейкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ТекстСообщения = "";
		Результат = ЗаписатьВРегистрНаСервере(ТекстСообщения);		
		Если Результат Тогда
			Объект.Ячейка = СкладскиеЯчейкиПустаяССылка;
			Объект.Товары.Очистить();
			
			Если ДополнительныеПараметры.ПолучитьТоварыИзЯчейки Тогда
				Объект.Ячейка = ДополнительныеПараметры.Ячейка;
				ЗаполнитьНоменклатуруНаСервере();
			КонецЕсли;
			
			ЕстьИзмененияДляЗаписи = Ложь;
		Иначе
			ПоказатьПредупреждение(, "Данные не записаны" + Символы.ПС + ТекстСообщения, 5);	
		КонецЕсли;

	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Объект.Ячейка = ДополнительныеПараметры.Ячейка;
		ЗаполнитьНоменклатуруНаСервере();
		ЕстьИзмененияДляЗаписи = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНоменклатуруНаСервере()
	Объект.Товары.Очистить();
	
	Если Объект.Ячейка <> СкладскиеЯчейкиПустаяССылка Тогда
	
		Если Режим = "ПроверкаАХ" Тогда
			ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
			СписокНоменклатурыДляЗаполнения = ДокументОбъект.ПолучитьНоменклатуруИзЯчейки(Объект.Склад, Объект.Ячейка, ТекущаяДата());
			
			Если СписокНоменклатурыДляЗаполнения.Количество() > 0 Тогда
				Для Каждого СтрокаСписка Из СписокНоменклатурыДляЗаполнения Цикл
					НовыйТовар = Объект.Товары.Добавить();
					НовыйТовар.Номенклатура = СтрокаСписка.Номенклатура;
					НовыйТовар.ИсходнаяЯчейка = Объект.Ячейка;
					НовыйТовар.ЦелеваяЯчейка = Объект.Ячейка;
					НовыйТовар.Проверено = Ложь; 
				КонецЦикла
			Иначе
			    Сообщить("В ячейке """ + Объект.Ячейка + " нет товара с ненулевым остатком");
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ТабличнаяЧастьТовары

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
	Если ЗначениеЗаполнено(Объект.Ячейка) Тогда
		УстановитьВидимостьГруппы("ВыборНоменклатуры");	
	Иначе
		ПоказатьПредупреждение(, "Необходимо сначала выбрать ячейку", 5);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	ДанныеСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ДанныеСтрока.ИсходнаяЯчейка) Тогда
		Сообщить("Вместо удаления товара """ + ДанныеСтрока.Номенклатура + """" + " из " + ДанныеСтрока.ИсходнаяЯчейка + " выберите действие ""Переложить в другую ячейку""");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЭлементыДляРедактированииСтроки(ЭлементСписка)
	Номенклатура = ЭлементСписка.Номенклатура;
	
	ИсходнаяЯчейка = ЭлементСписка.ИсходнаяЯчейка;
	Если ЗначениеЗаполнено(ЭлементСписка.ИсходнаяЯчейка) Тогда
		Элементы.ИсходнаяЯчейка.Видимость = Истина;
	Иначе
		Элементы.ИсходнаяЯчейка.Видимость = Ложь;
	КонецЕсли;
	
	Действие = ЭлементСписка.Действие;
	Если ЭлементСписка.Действие <> ДействиеПрисвоитьТекущуюЯчейку Тогда
		Элементы.Действие.Доступность = Истина;
	Иначе
		Элементы.Действие.Доступность = Ложь;
	КонецЕсли;
	
	ЦелеваяЯчейка = ЭлементСписка.ЦелеваяЯчейка;
	Если (ЭлементСписка.Действие = ДействиеПереложитьВДругуюЯчейку) Или (ЭлементСписка.Действие = ДействиеСделатьЯчейкуДополнительной) Тогда
		Элементы.ЦелеваяЯчейка.Видимость = Истина
	Иначе
		Элементы.ЦелеваяЯчейка.Видимость = Ложь;
	КонецЕсли;
	
	Проверено = ЭлементСписка.Проверено;
	НетЭтикетки = ЭлементСписка.НетЭтикетки;		
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда	
		
	Если Режим = "ПроверкаАХ" И Объект.Товары.Количество() > 0 Тогда
	
		ТекущаяСтрока = Элементы.Товары.ТекущаяСтрока;
					
			Если ТипЗнч(ТекущаяСтрока) <> Тип("Неопределено") Тогда
				
				ЭлементСписка = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока);			
				
				Если ЭлементСписка <> Неопределено Тогда
					УстановитьВидимостьГруппы("РедактированиеСтроки");
					
					УстановитьЭлементыДляРедактированииСтроки(ЭлементСписка);
				Конецесли;		
				
			Иначе
				Если СредстваМультимедиа.ПоддерживаетсяВоспроизведениеТекста() Тогда
					СредстваМультимедиа.ВоспроизвестиТекст("Товар не найден!","ru-RU");	
				КонецЕсли;
				ПоказатьПредупреждение(, "Товар не найден!", 5);
			КонецЕсли;
		
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьНепроверенныеПриИзменении(Элемент)
	Если ПоказыватьНепроверенные Тогда
		Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("Проверено", Ложь);
		Элементы.ПоказыватьНепроверенные.Заголовок = "Непров.";
	Иначе
		Элементы.Товары.ОтборСтрок = Неопределено;
		Элементы.ПоказыватьНепроверенные.Заголовок = "Все";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область КарточкаТовара

Функция ДополнительнаяЯчейкаНоменклатуры(Номенклатура)
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	Возврат ДокументОбъект.ПолучитьЯчейкуНоменклатуры(Объект.Склад, Номенклатура, Ложь);
КонецФункции

&НаКлиенте
Процедура ДействиеПриИзменении(Элемент)
	Элементы.ЦелеваяЯчейка.Видимость = ((Действие = ДействиеПереложитьВДругуюЯчейку) Или (Действие = ДействиеСделатьЯчейкуДополнительной));
	Если Элементы.ЦелеваяЯчейка.Видимость И (ЦелеваяЯчейка = ИсходнаяЯчейка) Тогда
		ЦелеваяЯчейка = СкладскиеЯчейкиПустаяСсылка;
	КонецЕсли;
	
	Если Действие = ДействиеСделатьЯчейкуДополнительной Тогда
		ДополнительнаяЯчейка = ДополнительнаяЯчейкаНоменклатуры(Номенклатура);
		Если ДополнительнаяЯчейка <> СкладскиеЯчейкиПустаяСсылка Тогда
			ПоказатьПредупреждение(, "У номенклатуры """ + Номенклатура + """" +  Символы.ПС + " уже есть дополнительная ячейка " + ДополнительнаяЯчейка
				+ Символы.ПС + "Дополнительная ячейка будет изменена на выбранную фактическую ячейку.", );	
		КонецЕсли;
	КонецЕсли;
	
	Проверено = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЦелеваяЯчейкаПриИзменении(Элемент)
	Проверено = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НетЭтикеткиПриИзменении(Элемент)
	Проверено = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЦелеваяЯчейкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьЯчейку(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЦелеваяЯчейкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЦелеваяЯчейка = ВыбранноеЗначение;
КонецПроцедуры

&НаСервере
Функция ЕстьОсновнаяЯчейкаУНоменклатурыНаСервере(Номенклатура, Склад, Ячейка)
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	Возврат ДокументОбъект.ЕстьОсновнаяЯчейкаУНоменклатуры(Номенклатура, Склад, Ячейка);
КонецФункции

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.Номенклатура = Элементы.СписокНоменклатуры.ТекущиеДанные.Ссылка;
	
	Если ЕстьОсновнаяЯчейкаУНоменклатурыНаСервере(НоваяСтрока.Номенклатура, Объект.Склад, Объект.Ячейка) Тогда
		НоваяСтрока.ИсходнаяЯчейка = Объект.Ячейка;
	Иначе
		НоваяСтрока.Действие = ДействиеПрисвоитьТекущуюЯчейку;
	КонецЕсли;
	
	НоваяСтрока.ЦелеваяЯчейка = Объект.Ячейка;
	НоваяСтрока.Проверено = Истина;

	ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	
	УстановитьВидимостьГруппы("Работа");	    
	
	ЕстьИзмененияДляЗаписи = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПрисвоитьШтрихкод(Команда)
	СоздатьШК(НовыйШтрихкод);
КонецПроцедуры

Процедура СоздатьШК(Штрихкод)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыНоменклатуры.Штрихкод,
	|	ШтрихкодыНоменклатуры.Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика,
	|	ШтрихкодыНоменклатуры.Упаковка,
	|	ШтрихкодыНоменклатуры.Номенклатура.Наименование КАК НоменклатураПредставление,
	|	ШтрихкодыНоменклатуры.Характеристика.Наименование КАК ХарактеристикаПредставление,
	|	ШтрихкодыНоменклатуры.Упаковка.Наименование КАК УпаковкаПредставление
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
	|";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ОписаниеОшибки = НСтр("ru='Такой штрихкод уже назначен для номенклатуры %Номенклатура%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Номенклатура%", """" + Выборка.НоменклатураПредставление + """"
		+ ?(ЗначениеЗаполнено(Выборка.Характеристика), " " + НСтр("ru='с характеристикой'") + " """ + Выборка.ХарактеристикаПредставление + """", "")
		+ ?(ЗначениеЗаполнено(Выборка.Упаковка), " " + НСтр("ru='в упаковке'") + " """ + Выборка.УпаковкаПредставление + """", ""));
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки;
		Сообщение.Сообщить();
		
	Иначе
		МенеджерЗаписи = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Штрихкод = Штрихкод;
		МенеджерЗаписи.Номенклатура = Номенклатура;

		МенеджерЗаписи.Записать();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Штрихкод записан!";
		Сообщение.Сообщить();
	КонецЕсли;

КонецПроцедуры
                                                  

#КонецОбласти




#Область Оповещения 
&НаКлиенте
Процедура Оповещения(Команда)
	Если ОповещенияИзОчереди Тогда
		ПричинаОтказа = "";
		ОповещенияПоСекцииПодключены = ПолучитьСостояниеОповещений();
				
		Если ПричинаОтказа = "" Тогда
			ОповещенияИзОчереди = Ложь;
			Сообщить("Оповещения отключены");
			Элементы.ГруппаСписокОчереди.Видимость = Ложь;
			ОтключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди");  
		Иначе
			Сообщить(ПричинаОтказа);
		КонецЕсли;
	Иначе
		ОповещенияИзОчереди = Истина;
		Сообщить("Оповещения подключены");
		Элементы.ГруппаСписокОчереди.Видимость = Истина; 
		ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь);  
		ПроверкаЭлектроннойОчереди(); 
	КонецЕсли;
	ЗаписатьЗначениеОповещения();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСписокОчереди(Команда)
	Если КлиентовВОчереди > 0 Тогда   
		ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.Форма", Новый Структура("Сотрудник,ИмяКоманды, ОткрытьОчередь",Объект.Сотрудник,"Отгрузка", Истина),ЭтотОбъект);  
	Иначе
		Сообщить("Список очереди пуст");
	КонецЕСли;	
КонецПроцедуры  

&НаСервере
Функция ЭлектроннаяОчередьНаСекции()
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ
				 |	РабочиеУчастки.Ссылка КАК Ссылка,
				 |	РабочиеУчастки.ЭлектроннаяОчередь КАК ЭлектроннаяОчередь
				 |ИЗ
				 |	Справочник.РабочиеУчастки КАК РабочиеУчастки
				 |ГДЕ
				 |	РабочиеУчастки.Ссылка В(&Секции)
				 |	И РабочиеУчастки.ЭлектроннаяОчередь = Истина" ;
	Запрос.УстановитьПараметр("Секции", СекцииСотрудника()); 
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда 
		Возврат Истина; 
	Иначе 
		Возврат Ложь; 
	КонецЕсли;
	
КонецФункции 

&НаСервере
Функция ПолучитьСостояниеОповещений()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиРабочиеУчастки.Ссылка.ОповещенияИзОчереди КАК ОповещенияИзОчереди
		|ИЗ
		|	Справочник.Сотрудники.РабочиеУчастки КАК СотрудникиРабочиеУчастки
		|ГДЕ
		|	СотрудникиРабочиеУчастки.РабочийУчасток В(&РабочийУчасток)
		|	И СотрудникиРабочиеУчастки.Ссылка <> &Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	СотрудникиРабочиеУчастки.Ссылка.ОповещенияИзОчереди";
	
	Запрос.УстановитьПараметр("РабочийУчасток", СекцииСотрудника());
	Запрос.УстановитьПараметр("Сотрудник", Объект.Сотрудник);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 1 И Результат.Найти(Истина, "ОповещенияИзОчереди") = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции 


&НаКлиенте
Процедура ПроверкаЭлектроннойОчереди() Экспорт
	ОбновитьСписокОчереди();  
КонецПроцедуры   

&НаСервере
Процедура ОбновитьСписокОчереди() 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭлектроннаяОчередьКлиентов.Документ КАК Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления КАК Получатель
	|ИЗ
	|	РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов 
	|ГДЕ
	|   ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику = Истина 
	|	И ЭлектроннаяОчередьКлиентов.ПолучательУведомления В (&Секции)   
	|	И не ЭлектроннаяОчередьКлиентов.Состояние = &Статус
	|
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭлектроннаяОчередьКлиентов.Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления";
	
	
	Запрос.УстановитьПараметр("Секции", СекцииСотрудника());
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЭлектроннойОчереди.Выдан);
    РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		КлиентовВОчереди = РезультатЗапроса.Выбрать().Количество(); 
	Иначе
       КлиентовВОчереди = 0;
   	КонецЕсли;  
КонецПроцедуры 	

&НаСервере
Процедура ЗаписатьЗначениеОповещения() 
	УстановитьПривилегированныйРежим(Истина);
	ОбъектСотрудник = Объект.Сотрудник.ПолучитьОбъект();
	ОбъектСотрудник.ОповещенияИзОчереди = ОповещенияИзОчереди;
	ОбъектСотрудник.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Функция СекцииСотрудника()
	Возврат Объект.Сотрудник.РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток");
КонецФункции

#КонецОбласти
